# -*- mode: org; pyenv-workon: "machine_learning-3.12"; -*-

;; Import block

#+begin_src python :session my_ai_env :results silent

  import numpy as np
  import pandas as pd
  from scipy import sparse

#+end_src


#+begin_src python :session my_ai_env :results output
    a = np.random.randint(1,10,(4,3))
    b = np.random.randint(1,5,(4))

    print(a-b[:,np.newaxis])

#+end_src

#+RESULTS:
: [[2 2 2]
:  [1 6 3]
:  [1 2 5]
:  [3 3 4]]




#+begin_src python :session my_ai_env :results output
  dense_matrix = np.zeros((10,10))
  dense_matrix[0,2] = 5
  dense_matrix[4,1] = 9

  # convert to compressed Sparse Row format
  sparse_matrix = sparse.csr_matrix(dense_matrix)

  print(f"Dense size: {dense_matrix.nbytes} bytes")
  print(f"Sparse non-zero count: {sparse_matrix.nnz}")
  print(sparse_matrix)

#+end_src

#+RESULTS:
: Dense size: 800 bytes
: Sparse non-zero count: 2
: <Compressed Sparse Row sparse matrix of dtype 'float64'
: 	with 2 stored elements and shape (10, 10)>
:   Coords	Values
:   (0, 2)	5.0
:   (4, 1)	9.0



#+begin_src python :session my_ai_env :results output
  v = np.random.randint(1,5,(10))

  print(sparse_matrix.dot(v))
  

#+end_src

#+RESULTS:
: [15.  0.  0.  0. 27.  0.  0.  0.  0.  0.]

* Element-wise and Dot Product

#+begin_src python :session my_ai_env :results output

  x = np.array([[1,2],[3,4]])
  y = np.array([[5,6],[7,8]])

  print(f"x*y={x*y}")
  print(f"np.multiply(x,y)={np.multiply(x,y)}")

  print(f"np.dot(x,y)={np.dot(x,y)}")
  print(f"x.dot(y)={x.dot(y)}")


#+end_src

#+RESULTS:
: x*y=[[ 5 12]
:  [21 32]]
: np.multiply(x,y)=[[ 5 12]
:  [21 32]]
: np.dot(x,y)=[[19 22]
:  [43 50]]
: x.dot(y)=[[19 22]
:  [43 50]]

#+begin_src python :session my_ai_env :results output
  x = np.array([[1,2],
               [3,4],
               [5,6]])


  print(f"sum of all elements: np.sum(x) = {np.sum(x)}")
  print(f"sum of each column: np.sum(x, axis=0) = {np.sum(x,axis=0)}")
  print(f"sum of each row: np.sum(x, axis=1) = {np.sum(x,axis=1)}")

#+end_src

#+RESULTS:
: sum of all elements: np.sum(x) = 21
: sum of each column: np.sum(x, axis=0) = [ 9 12]
: sum of each row: np.sum(x, axis=1) = [ 3  7 11]


#+begin_src python :session my_ai_env :results output
  # create an isolated generator with a specific seed
  rng = np.random.default_rng(seed=700868847)

  a = rng.integers(1,10,size=(2,2,3))
  b = rng.integers(1,10,size=(2,3))

  #a = np.random.randint(1,10,(2,2,3))
  #b= np.random.randint(1,10,(2,3))
  print(a)
  print(b)

  # sum along the last dimension
  sum_2 = np.sum(a, axis=-1, keepdims=True)
  print(f"{sum_2.shape=}")
  print(f"{sum_2=}")
  # squash the first dimension
  sum_3 = np.sum(a,axis=0, keepdims=True)
  print(f"{sum_3=}")


#+end_src

#+RESULTS:
#+begin_example
[[[2 4 3]
  [1 8 3]]

 [[5 5 5]
  [9 7 5]]]
[[2 7 4]
 [5 5 9]]
sum_2.shape=(2, 2, 1)
sum_2=array([[[ 9],
        [12]],

       [[15],
        [21]]])
sum_3=array([[[ 7,  9,  8],
        [10, 15,  8]]])
#+end_example


#+begin_src python :session my_ai_env :results output
  x0= np.linspace(1,6,num=6,dtype=int).reshape(3,2)

  x1 = np.array( [[1,2],[3,4],[5,6]] )
  print(f"{x0=}")
  print(f"{x1=}")
  print(f"{np.reshape(x1,(2,3))=}")
  print(f"{len(x1)=} len is different than size.\n len() tells you the size of 1st\
  dim")
  print(f"{x1.size=} size tells you the total number of elements")
  print(f"flatten {np.reshape(x,-1)=}")
#+end_src

#+RESULTS:
#+begin_example
x0=array([[1, 2],
       [3, 4],
       [5, 6]])
x1=array([[1, 2],
       [3, 4],
       [5, 6]])
np.reshape(x1,(2,3))=array([[1, 2, 3],
       [4, 5, 6]])
len(x1)=3 len is different than size.
 len() tells you the size of 1stdim
x1.size=6 size tells you the total number of elements
flatten np.reshape(x,-1)=array([1, 2, 3, 4, 5, 6])
#+end_example

#+begin_src python :session my_ai_env :results output
  x =np.linspace(1,4,num=4,dtype=int)
  print(f"{x=}")
  print(f"{x.shape=}")

  y = np.linspace(1,6,num=6,dtype=int).reshape(2,3)
  print(f"{y=}")
  print(f"{y.shape=}")
#+end_src

#+RESULTS:
: x=array([1, 2, 3, 4])
: x.shape=(4,)
: y=array([[1, 2, 3],
:        [4, 5, 6]])
: y.shape=(2, 3)


#+begin_src python :session my_ai_env :results output
  # Extend/squeeze dimensionality

  print(f"{x=}")
  print(f"{x.shape=}")
  #extend x to have shape (1,4)
  print(f"{np.expand_dims(x, axis = 0 )=}")
  print(f"{np.expand_dims(x, axis = 0 ).shape=}")

  print(x[None,:])
  print(f"{x[None,:].shape=}")
  print(x[np.newaxis,:])
  print(f"{x[np.newaxis,:].shape=}")



#+end_src

#+RESULTS:
: x=array([1, 2, 3, 4])
: x.shape=(4,)
: np.expand_dims(x, axis = 0 )=array([[1, 2, 3, 4]])
: np.expand_dims(x, axis = 0 ).shape=(1, 4)
: [[1 2 3 4]]
: x[None,:].shape=(1, 4)
: [[1 2 3 4]]
: x[np.newaxis,:].shape=(1, 4)


#+begin_src python :session my_ai_env :results output



#+end_src
